{
  "meta": {
    "totalVacancies": 529,
    "parsedAt": "2026-01-29T09:46:36.369Z",
    "sourceUrls": 529
  },
  "vacancies": [
    {
      "id": "129992713",
      "title": "Golang-разработчик",
      "url": "https://hh.ru/vacancy/129992713?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ООО Рестрим Медиа",
        "url": "https://hh.ru/employer/9587203?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Москва, Проспект Вернадского, Проспект Вернадского, проспект Вернадского, 41",
      "description": "На данный момент в продукте Wink более 13-млн активных пользователей и более 200,000 единиц контента (фильмов и сериалов), более 4000 live телеканалов и 8-млн программ телепередач. NewCache — реализует концепцию «тонкого клиента»: клиентские продукты на основе Wink (мобильные приложения, Smart TV, STB, сайт wink.ru) получают со стороны New Cache только такие срезы данных, которые необходимы для отображения на экране в текущий момент. Архитектура New Cache складывается из нескольких специализированных сервисов и ряда типовых сервисов сторонних разработчиков. Стек:  Golang Docker, Gitlab PostgreSQL Nginx NSQ Reindexer - встраиваемая документо-ориентированная СУБД, которая работает с in-memory базами данных и опционально может использовать дисковое хранилище. Основная отличительная особенность reindexer — быстрый поиск по сложным запросам.  Обязанности:  Разрабатывать высоконагруженные сервисы на Go Покрывать unit тестами свой код Участвовать в проектировании архитектуры системы Оптимизировать запросы в высоконагруженных компонентах Участвовать в код-ревью  Требования:  Опыт разработки на Go от 2-х лет Умение писать чистый, тестируемый код на Go Опыт работы с PostgreSQL, Clickhouse Опыт разработки высоконагруженных, отказоустойчивых систем Опыт работы с Kafka Опыт работы с метриками Prometheus, понимание уже существующих в сервисах и добавление новых метрик Git, Github Базовое владение Linux  Условия:   Оформление по ТК РФ   Достойный доход: оклад + квартальная премия   Можно работать удаленно, гибридно или в офисе   Заботу о здоровье: ДМС со стоматологией   Доступ к обучающим ресурсам, а также возможность проходить внутренние и внешние обучения за счет компании   Well-being-программа, которая помогает улучшить психологическое и физическое здоровье   Мы общаемся друг с другом на «ты» и всегда открыты к диалогу, мы дружная и открытая среда профессионалов своего дела",
      "skills": [],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:13:36.028Z"
    },
    {
      "id": "129935764",
      "title": "Backend-разработчик TypeScript/Golang",
      "url": "https://hh.ru/vacancy/129935764?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Оператор связи Комфортел",
        "url": "https://hh.ru/employer/965294?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Санкт-Петербург, Комендантский проспект, Пионерская, проспект Сизова, 9",
      "description": "Комфортел — оператор связи для бизнеса с 17-летним опытом. Работаем со средним и крупным бизнесом, госучреждениями и другими операторами. Мы — не бюрократическая корпорация, а компания, где решения принимаются быстро, и управление строится на здравом смысле, а не на сотнях регламентов. Наши сотрудники — наша главная ценность. Средний срок работы в компании — 3,5 года, и это не случайность: мы инвестируем в людей, а они — в нас. Мы растём ежегодно: по выручке, географии (офисы в СПб, Москве и Алматы) и команде. У нас много проектов в работе и сейчас мы в поисках Backend-разработчика в один из них: DiPal — это цифровой помощник, superApp, система, призванная упростить ежедневные бытовые процессы, сделать жизнь комфортнее, безопаснее и экономнее. Включает в себя видеодомофонию, видеонаблюдение, контроль доступа и заявки в УК.  Что мы предлагаем:   Свободу вместо регламентов: гибкий график, общение на «ты» и минимум бюрократии;   Просторный светлый офис у м. Комендантский проспект со всеми благами: чай, кофе, корпоративная библиотека, зона отдыха, кикер, автоматы со снеками, уютный сквер для обедов на свежем воздухе;   Официальное трудоустройство и работу в офисе (удаленный или гибридный формат работы предложить не можем);  Работу в сильной команде с возможностью многому научиться; Карьеру без потолка: руководителей растим внутри, а не ищем на стороне; Удобные рабочие места, оснащенные всем необходимым; Дружный коллектив и непринужденную атмосферу.  Что мы ожидаем от вас:  Владение TypeScript или Golang (требуется хотя бы один) и огромное желание изучить второй язык; Знание фреймворков и инструментов TypeScript (опыт работы с Nest.js для модульной разработки серверной части; умение работать с Vitest или Jest для тестирования; знания Rx.js и Apollo GraphQL для API будет преимуществом) или Golang (Gin для HTTP-микросервисов, Testify или Testing для тестирования. Будет преимуществом знание Viper для управления конфигурацией, Fx для внедрения зависимостей, понимание Gorilla WebSocket для работы в реальном времени); Опыт работы с базами данных (MongoDB/PostgreSQL/Redis);  Опыт работы с брокерами сообщений (Kafka/Rabbit/Nats);  Умение работать в команде; Осведомленность о CI/CD; Навыки решения проблем и отладки.  Будет плюсом:    Знание принципов SOLID, ООП, функционального программирования и паттернов проектирования;   Опыт работы с микросервисами, REST API, GraphQL или WebSocket   С чем предстоит работать:  Nest.JS и Gin микросервисы; MongoDB как основная база данных; PostgreSQL (используется выборочно, с планами расширения); Redis для кэширования; NATS как основной брокер сообщений (аналог Kafka). Kafka и MQTT в некоторых частях системы (очень редко).  Как мы работаем:Минимум бюрократии, максимум практики. В команде - профессионалы, которые ценят компетентность больше, чем пустые разговоры. Если вы разделяете наши ценности и хотите присоединиться к команде — ждём ваших откликов!",
      "skills": [
        "Golang",
        "Backend",
        "TypeScript"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:13:40.183Z"
    },
    {
      "id": "129457871",
      "title": "Middle Golang Developer | Программист GO",
      "url": "https://hh.ru/vacancy/129457871?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "АО Интернет Проекты",
        "url": "https://hh.ru/employer/1589180?hhtmFrom=vacancy"
      },
      "salary": {
        "from": null,
        "to": 275862,
        "currency": "RUB",
        "gross": true
      },
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Санкт-Петербург, Крестовский остров, Петроградская, Спортивная, Чкаловская, Левашовский проспект, 11/7",
      "description": "Компания \"Интернет Проекты\" существует более 30 лет, мы продолжаем развиваться и масштабируем команду. Наш продукт — крупнейшая российская платформа по автоматизации маркетинга повторных продаж Sendsay (CDP платформа, email и sms маркетинг, анализ клиентских данных). Чем предстоит заниматься:  Разработка и поддержка сервисов на Go с REST API Миграция сервисов на Go Работа с OpenAPI Проектирование и документирование API, создание SDK.  Технические требования: • Языки и технологии  Go 1.25 как основной язык Разработка REST API, уверенное знание HTTP/1.1 и middleware OpenAPI 3.0 для проектирования и документирования API  • Фреймворки и библиотеки  Gin - веб-фреймворк (gin-gonic/gin, gin-contrib/cors, gin-contrib/requestid) Clean Architecture - архитектурный подход OAPI-codegen - генерация кода из OpenAPI спецификаций  • Базы данных и кэширование  PostgreSQL - основная БД Redis - кеширование и сессии (go-redis/v9) ClickHouse - основная OLAP БД (clickhouse-go/v2)  • Тестирование  ​​​​​​​Ginkgo/Gomega (onsi/ginkgo/v2, onsi/gomega) для BDD Testify (stretchr/testify) для unit‑тестов и моков​​​​​​​​​​​​​​  •​​​​​​​ DevOps и инфраструктура   Git, GitLab CI, GitHub Actions, SVN, ArgoCD - системы контроля версий и CI/CD Prometheus/Grafana/Loki - мониторинг, метрики и логирование Docker и Docker Compose для локальной разработки golangci-lint, spectral - линтеры​​​​​​​  Будет преимуществом:   Kubernetes (пользовательский уровень) - оркестрация контейнеров LXC - системные контейнеры для изоляции приложений Опыт миграции legacy-систем на Go - Performance optimization и профилирование Go приложений Опыт с телеметрией и мониторингом Работа с AI/ML интеграциями (OpenRouter)",
      "skills": [],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:13:51.585Z"
    },
    {
      "id": "129817982",
      "title": "Младший Backend-разработчик (Golang)",
      "url": "https://hh.ru/vacancy/129817982?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "SAPTIME",
        "url": "https://hh.ru/employer/3537060?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "На проект с нуля проводим отбор в команду сильных Junior-разработчиков. Взамен на твои навыки мы предлагаем интересный проект полного цикла в твой портфолио. После успешного запуска продукта возможно продолжение сотрудничества на коммерческих условиях. Обязанности:   Интенсивная проектная практика в реальном продукте   Участие в разработке архитектуры   Проектирование и разработка ядра и других модулей   Разработка межмодульной интеграции   Реализация базовых механизмов аутентификации и авторизации   Логирование, обработка ошибок, метрики   Написание unit-тестов и нагрузочного теста   Работа с Git и code review   Требования:   Наличие высшего профильного образования   Уверенное владение Go от 2 лет   Опыт использования воркеров в Go   Понимание принципов микросервисной архитектуры, знание основных паттернов проектирования   Базовые знания в области контейнеризации (Docker) и оркестрации (Kubernetes)   Опыт работы с Kafka, знание принципов масштабирования и отказоустойчивости   Знание TLS/mTLS, JWT, OAuth2   Опыт работы с JSON и Protocol Buffers (Protobuf)   Опыт работы с системами мониторинга: Prometheus, Grafana   Базовые навыки работы с базами данных   Уверенная работа с Git   Условия:   Практика проходит без денежной компенсации   Гибкий график, можно совмещать с основной работой   Интенсивная проектная практика в реальном продукте   Возможен переход на оплачиваемую позицию после завершения проекта   Отзывы и рекомендации по результатам работы   Что мы ценим в кандидате:   Проактивность и вовлечённость — готовность работать в команде, помогать в достижении результатов, предлагать решения.   Аналитический склад ума — стремление разобраться в сложных задачах, умение задавать вопросы, изучать новые технологии.   Нацеленность на долгосрочную работу — готовность учиться на сложных задачах, расти вместе с проектом и другими участниками команды.",
      "skills": [
        "Redis",
        "Golang",
        "Kubernetes",
        "Kafka",
        "Nginx",
        "SQL",
        "Git",
        "PostgreSQL"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:14:22.705Z"
    },
    {
      "id": "129662802",
      "title": "Golang-разработчик",
      "url": "https://hh.ru/vacancy/129662802?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Группа компаний Экзон",
        "url": "https://hh.ru/employer/12047264?hhtmFrom=vacancy"
      },
      "salary": {
        "from": 180000,
        "to": 220000,
        "currency": "RUB",
        "gross": false
      },
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Экзон Групп — ведущий разработчик и интегратор инновационных IT-решений в сфере строительства. Мы разрабатываем облачную платформу EXON, предназначенную для автоматизации и оптимизации строительных процессов. Наша миссия — объединить всех участников строительного процесса на одной платформе, обеспечивая прозрачность и ясность на каждом этапе работы. Ищем Golang-разработчика в нашу команду. Ценим в своих сотрудниках ответственность и самостоятельность. Создаём комфортную и поддерживающую рабочую атмосферу, помогаем развиваться и инвестируем в обучение.Обязанности:  Разработка Бэкенд приложений (web api) с 0; Поддержка текущих проектов; Интеграция с различными внешними сервисами; Стремление разделять монолиты на микросервисы и знание, как и когда это делать; Предлагать пути оптимизации и развития архитектуры в целом и отдельных реализаций;  Требования:  Самостоятельная разработка 5+ сервисов; Самостоятельный сбор требований, либо обсуждение и доработки требований от аналитики; Самостоятельное проектирование/доработки готовой БД; Опыт в работе с очередями kafka/rabbit mq; Хорошие soft скилы для участия в обсуждениях с аналитиками\\заказчиками; Опыт Go от 2-х лет.  Мы предлагаем:  Конкурентную белую заработную плату; Удаленный формат работы по территории РФ; Наставничество со стороны опытных коллег и обучение за счёт компании; Команду единомышленников, с которой интересно работать и общаться.",
      "skills": [],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:15:02.129Z"
    },
    {
      "id": "126226616",
      "title": "Middle Golang Developer (Офис)",
      "url": "https://hh.ru/vacancy/126226616?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "SpectrumData",
        "url": "https://hh.ru/employer/3542906?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Екатеринбург, Геологическая, улица Добролюбова, 16/2",
      "description": "SpectrumData - IT-компания, предоставляющая решения по управлению рисками на основе больших данных. Наши клиенты – лидирующие страховые компании и платформы, банки, МФО, лизинговые компании, IT, сетевой ритейл, компании автомобильной отрасли и другие. Преимущества компании:  Мы занимаем лидирующие позиции на рынке и количество сотрудников постоянно растет, мы уже объединяем более 200 профессионалов; Презентуем наши продукты на крупных отраслевых конференциях и организовываем собственные клиентские мероприятия; Работаем с данными с 2010 года; Аккредитованы как IT-компания в Минцифре РФ; Мы создаем востребованные IT-решения для бизнеса, наша сфера деятельности является перспективной, динамично растущей и стабильной относительно влияния внешних факторов.  Мы расширяем команду и находимся в поисках GO разработчика, который будет сопровождать следующие сервисы:  Шина событий - event-driven система, позволяющая отслеживать изменения данных и уведомлять об этом клиентов (мониторинг бизнес-событий). Шина данных - развитие и сопровождение решения, обеспечивающее доступ к разнородным источникам данных и их агрегацию. Данное решение обеспечивает ролевую модель доступа к данным.  Что мы любим и используем:  Go, Protobuf, GRPC. Cassandra, PostgreSQL; Elasticsearch; Redis, RabbitMQ, Kafka; Микросервисную архитектуру; Положительно относимся к освоению других новых технологий.  Мы будем рады видеть тебя в нашей команде, если ты имеешь:  Не менее 2х лет опыта по написанию бизнес приложений, желательно Golang, но можно Kotlin/Java и есть желание перейти на Golang; Опыт реализовывать веб сервисы - HTTP/Rest; Уверенное владение асинхронным и параллельным программированием; Опыт модульного и интеграционного тестирования, понимание TDD; Понимание принципов SOLID, DRY, KISS, основных паттернов и умение их применять; Понимание концепций микросервисных систем, основанных на событиях и/или опыт работы с брокерами сообщений и микросервисами; Уверенное владение SQL и в частности PostgreSQL.  Как будет построена твоя работа:  Официальное трудоустройство, белая заработная плата; Гибкое начало рабочего дня; Регулярный пересмотр заработной платы по мере твоего развития в компании; Современное \"железо\" и любые необходимые сервисы; Ты будешь работать по Scrum в слаженной команде; Тебя ждут TDD, code review и внутренние митапы :)",
      "skills": [
        "Golang",
        "gRPC",
        "PostgreSQL",
        "Apache Cassandra",
        "Микросервисная архитектура",
        "Kotlin"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:15:25.542Z"
    },
    {
      "id": "122246408",
      "title": "Golang-разработчик",
      "url": "https://hh.ru/vacancy/122246408?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Т-Банк. ИТ. Разработка",
        "url": "https://hh.ru/employer/78638?dpt=78638-78638-develop&hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Безопасность — часть нашего бизнеса, поэтому мы создаем продукты, следуя принципу security by design. Мы открыты и защищаем не только себя, но и партнеров.Мы ищем Golang-разработчика в направление разработки высоконагруженных продуктов и платформ Информационной Безопасности (CyberSecurity).   Требования:  Опыт разработки на golang  Опыт разработки многопоточных приложений Опыт разработки web-сервисов (REST, gRPC, WebSocket) Опыт работы с реляционными базами данных (преимущественно postgresql) Опыт работы с нереляционными базами данных Опыт работы с брокерами сообщений (преимущественно kafka) Владение инструментами CI/CD и автоматического деплоя Опыт работы с инструментами мониторинга (prometheus, grafana) Опыт работы с unix-системами Будет плюсом опыт реализации high-load решений Будет плюсом опыт проектирования и разработки решений в области информационной безопасности Будет плюсом опыт разработки продуктов на базе открытых решений    Обязанности:  Разработка нагруженных backend-приложений Участие в проектировании внутреннней архитектуры приложений и code review Разработка unit-тестов Проработка метрик в приложении для дальнешей настройки мониторинга и алертинга Участие в системном анализе Участие в проработке и принятии архитектурных решений    Мы предлагаем:  Возможность работы в аккредитованной ИТ-компании. Достойная твоего профессионального уровня зарплата, размер обсудим на собеседовании Профессиональное развитие: проводим митапы, тренинги и мастер-классы Гибридный формат работы Гибкий рабочий график с началом работы с 8:00 до 11:00 Компенсация обедов Забота о здоровье: полис ДМС со стоматологией и страховка от несчастных случаев для тебя и льготные условия страхования для близких Компенсация затрат на спорт.",
      "skills": [],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:16:51.204Z"
    },
    {
      "id": "129456228",
      "title": "Golang-разработчик",
      "url": "https://hh.ru/vacancy/129456228?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Кучеров Ростислав",
        "url": "https://hh.ru/employer/12540646?hhtmFrom=vacancy"
      },
      "salary": {
        "from": 200000,
        "to": null,
        "currency": "RUB",
        "gross": false
      },
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Москва, Багратионовская, Парк Победы, Фили, Фили, Промышленный проезд",
      "description": "Погрузитесь в мир высоких технологий и станьте частью команды, создающей инновационные решения на языке Go.Обязанности  Разработка и поддержка серверных приложений на Golang Оптимизация и рефакторинг существующего кода Участие в проектировании архитектуры приложений Взаимодействие с командой для достижения общих целей Тестирование и обеспечение качества кода  Требования  Опыт разработки на Golang от 3 года Знание принципов ООП и паттернов проектирования Умение работать с базами данных и API Ответственность и умение работать в команде Желание развиваться и обучаться новому  Условия  Конкурентная заработная плата Работа в офисе в Москве График 5/2, 8-часовой рабочий день Возможности для профессионального роста и обучения Дружелюбный коллектив и комфортная рабочая атмосфера",
      "skills": [
        "PostgreSQL",
        "Git",
        "REST",
        "Golang",
        "Английский язык",
        "Linux",
        "Kubernetes",
        "Docker",
        "MySQL",
        "Английский — B1 — Средний"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:18:44.495Z"
    },
    {
      "id": "129462667",
      "title": "Golang-разработчик",
      "url": "https://hh.ru/vacancy/129462667?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Т-Банк. ИТ. Разработка",
        "url": "https://hh.ru/employer/78638?dpt=78638-78638-develop&hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Саратов, улица имени И.С. Кутякова, 3",
      "description": "Требования  Опыт разработки на golang от 3-х лет Опыт разработки многопоточных приложений Опыт разработки web-сервисов (REST, gRPC, WebSocket) Опыт работы с реляционными базами данных (преимущественно postgresql) Опыт работы с нереляционными базами данных Опыт работы с брокерами сообщений (преимущественно kafka) Владение инструментами CI/CD и автоматического деплоя Опыт работы с инструментами мониторинга (prometheus, grafana) Опыт работы с unix-системами Будет плюсом опыт реализации high-load решений Будет плюсом опыт проектирования и разработки решений в области информационной безопасности Будет плюсом опыт разработки продуктов на базе открытых решений  Обязанности  Разработка нагруженных backend-приложений Участие в проектировании внутренней архитектуры приложений и code review Разработка unit-тестов Проработка метрик в приложении для дальнейшей настройки мониторинга и алертинга Участие в системном анализе Участие в проработке и принятии архитектурных решений  Мы предлагаем  Возможность работы в аккредитованной ИТ-компании. Работу в офисе. График работы — гибридный.  Платформу обучения и развития Т-Банк Апгрейд. Курсы, тренинги, вебинары и базы знаний. Поддержка менторов и наставников, помощь в поиске точек роста и карьерном развитии.  Заботу о здоровье. Оформим полис ДМС со стоматологией и страховку от несчастных случаев. Предложим льготное страхование вашим близким. Компенсацию на спорт. Компенсацию такси и обедов. А если захотите перекусить, есть кухня с чаем, кофе и фруктами. Достойную зарплату — обсудим ее на собеседовании.",
      "skills": [],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:18:52.368Z"
    },
    {
      "id": "121928396",
      "title": "Golang-разработчик в DevPlatform",
      "url": "https://hh.ru/vacancy/121928396?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Т-Банк. ИТ. Разработка",
        "url": "https://hh.ru/employer/78638?dpt=78638-78638-develop&hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "DevPlatform — новый внутренний продукт Т-Банка. Мы создали его, чтобы стандартизировать и формализовать лучшие практики поставки ИТ-ценности в Т-Банк. Наша цель — дать разработчикам удобный набор инструментов для написания кода, запуска тестов и деплоя в продакшен, который поможет им сфокусироваться на создании новых продуктов и фич, а не на изучении DevOps. Мы ищем Golang-разработчика, который займется разработкой системы Distributed Tracing на основе открытых компонентов (Jaeger / OpenTelemetery Collector / Cassandra). Под разработкой мы понимаем: — продуктизацию сервисов сбора и хранения трейсов; — создание подходящих под задачу алгоритмов хвостового семплирования; — создание системы динамического управления проектными квотами, которая позволит нам сохранять полезные трейсы и отбрасывать заурядные.   Обязанности:  Разрабатывать инфраструктурный сервис для сбора распределенных трейсов Заниматься дизайном и имплементацией подходов к управлению нагрузкой: QoS на пропускную способность, динамическое/адаптивное семплирование и так далее Разрабатывать подходы к обеспечению надежности системы сбора трейсов, определять SLO/SLI Участвовать во внедрении распределенного трейсинга, в том числе в создании каталога согласованных библиотек инструментализации под технологический радар Т-Банк.    Требования:  У вас есть опыт промышленной разработки на Go. Опыт с Java, Kotlin и C++ будет плюсом Понимаете принципы архитектуры многокомпонентных систем — балансировку нагрузки, обеспечение отказоустойчивости и так далее — и умеете применять эти знания на практике Знаете экосистему CloudNative: K8s, Prometheus и Jaeger Умеете работать с Cassandra, Elasticsearch, ClickHouse и Kafka, в том числе сайзить инфраструктуру    Мы предлагаем:  Возможность работы в аккредитованной ИТ-компании. Достойная твоего профессионального уровня зарплата, размер обсудим на собеседовании Профессиональное развитие: проводим митапы, тренинги и мастер-классы Гибридный формат работы Гибкий рабочий график с началом работы с 8:00 до 11:00 Компенсация обедов Забота о здоровье: полис ДМС со стоматологией и страховка от несчастных случаев для тебя и льготные условия страхования для близких Компенсация затрат на спорт.",
      "skills": [],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:18:59.628Z"
    },
    {
      "id": "129422033",
      "title": "Golang-разработчик",
      "url": "https://hh.ru/vacancy/129422033?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Веб-Мост",
        "url": "https://hh.ru/employer/735614?hhtmFrom=vacancy"
      },
      "salary": {
        "from": 160000,
        "to": 230000,
        "currency": "RUB",
        "gross": false
      },
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Москва, Красносельская, Сокольники, Русаковская улица, 13",
      "description": "О компании: ЭлЖур - это IT-компания, разрабатывающая информационную систему учета успеваемости - электронный журнал для школ и электронный дневник для учеников и родителей. C нами работает более 5000 школ по всей России. Среди наших клиентов ведущие школы, гимназии и лицеи РФ: Школа Летово, Школа Сотрудничества, Лицей Национального исследовательского университета \"Высшая школа экономики\" (НИУ \"ВШЭ\"), Лицей №1511 при Московском инженерно-физическом институте (МИФИ), ФизТех Лицей им. Капицы и многие другие. Наши ценности:  Профессионализм: мы эффективно выполняем свою работу с высоким результатом благодаря отличному знанию своей специальности и умению глубоко погрузиться в задачу. Лидерство: мы опережаем другие компании на рынке через создание превосходных отличий и конкурентных преимуществ. Честность и ответственность: мы правдивы; искренни, надежны в делах и не используем двойные стандарты. Взаимовыручка: мы помогаем друг другу, работая на общий результат.  Чем предстоит заниматься:  разработка новых функциональностей сервиса на Go; развитие/доработка существующих функциональностей в рамках сервиса на Go; выработка технических решений для реализации функционала; оптимизация/рефакторинг Go-кода.  Мы используем:  PHP 7, Laravel, Twig, Guzzle, PHPStan, Deployer. MySQL 8, Redis, Go, Linux Vue.js, Vuex, Yarn, Lodash, Font Awesome Pro, ESLint. GitLab, Drone CI, Redmine.  Наши пожелания:  Хорошее владение Go, можем рассмотреть программиста с отличным знанием php и базовыми знаниями go; базовое понимание архитектуры/устройства ОС (Linux); архитектура программных решений/компонентов; моделирование БД (PostgreSQL); знание и применение паттернов разработки; Docker, Docker Compose- на уровне, достаточном для развертывания приложений, их отладки. Опыт разработки от двух лет Опыт проектирования REST/gRPC API  Мы предлагаем:  Интересную и динамичную работу в стабильной компании с 10-ти летней историей. Корпоративные мероприятия. Чай/кофе, кухня в офисе. Офис компании находится в 8-минутах пешком от метро Красносельская/Сокольники. Бизнес-центр класса В+. Полное соответствие ТК РФ. Белую заработную плату. Выплаты 2 раза в месяц, без задержек. График работы: 5/2, выходные - суббота и воскресенье. Формат на выбор: офис или гибридный. Гибкое начало рабочего дня: 8:00-11:00. Очень сплоченную команду, где развиты черты взаимного уважения и взаимовыручки. Возможность профессионального и карьерного развития в рамках масштабных и интересных проектов; уровень задач предполагает постоянное развитие и обучение.",
      "skills": [
        "PHP",
        "MySQL",
        "Laravel",
        "Vue.js",
        "Git",
        "Twig",
        "Redis",
        "Docker",
        "Golang",
        "Linux",
        "Docker-compose",
        "REST",
        "API"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:19:11.914Z"
    },
    {
      "id": "128980986",
      "title": "Golang-разработчик",
      "url": "https://hh.ru/vacancy/128980986?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "RecPlace",
        "url": "https://hh.ru/employer/10575675?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Краснодар, Клиническая улица, 4",
      "description": "RecPlace - это инновационная SaaS платформа, направленная на полную автоматизацию маркетинговых процессов на геосервисах.RecPlace сегодня:Облачная SaaS-платформа, которой доверяют 7000+ предпринимателей и 400+ агентств.Аккредитованная IT-компания.Наши партнеры - ПроДокторов, Авито, Точка Банк и другие крупные компании.Команда из 50+ профессионалов, которые ежедневно создают решения и генерируют идеи для развития маркетинга.Резидент Сколково, участник акселераторов ФРИИ, Сбера.Сейчас мы расширяемся и ищем Golang-разработчика.Мы предлагаем:Прозрачная система мотивации, которую обсудим на собеседовании, выплаты дважды в месяц.Официальное трудоустройство в IT-компанию с первого дня, полностью белая зарплата.График 5/2 с выходными в субботу и воскресенье.Удаленный формат, гибкое начало дня (мы за свободу и ответственность).Возможность стать частью инновационной компании, изменяющей рынок через AI технологии.Атмосферу стартапа, в котором ценится каждая идея.Корпоративные мероприятия за счет компании (обучение, корпоративы, конкурсы, праздники, внутренняя бонусная программа).Получение всех льгот, которые дает работа в IT-компании (отсрочка от службы, IT-ипотека)Чем предстоит заниматься:Разработка и поддержка отказоустойчивых микросервисов на Go.Проектирование архитектуры с учётом масштабируемости и устойчивости.Рефакторинг и покрытие кода тестами.Участие в проектировании новых решений и обсуждении технических задач.Работа по внутренним стандартам (git flow, code review, task tracking).Что для нас важно:Опыт коммерческой разработки от 1 года.Отличное знание Go или Python с готовностью перейти на Go.Понимание микросервисной архитектуры, HTTP-протокола, основных архитектурных паттернов.Опыт работы с PostgreSQL, брокерами сообщений (NATS / RabbitMQ).Навыки многопоточности, написания тестов, работы с метриками.Умение читать и рефакторить чужой код.Знание Docker, Docker Compose, Git.Технический английский для чтения документации.Будет плюсом:Опыт с Redis, MongoDB, Linux.Опыт в разработке GRPC-приложений, принципов DDD, CI/CD.Ответственность, самостоятельность, инициативность, желание развиваться.Если интересны технологические вызовы, возможность роста и участие в создании сложных систем – откликайтесь, будем рады познакомиться!При отклике укажите, пожалуйста, ваши ожидания по заработной плате.",
      "skills": [
        "PostgreSQL",
        "Git",
        "Golang",
        "Docker",
        "Linux",
        "Python",
        "MongoDB"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:19:28.061Z"
    },
    {
      "id": "129491106",
      "title": "Backend-разработчик (Golang)",
      "url": "https://hh.ru/vacancy/129491106?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ИП Заозеров Андрей Анатольевич",
        "url": "https://hh.ru/employer/10097054?hhtmFrom=vacancy"
      },
      "salary": {
        "from": 45000,
        "to": null,
        "currency": "RUB",
        "gross": false
      },
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Пермь, улица 25 Октября, 70/1",
      "description": "Здравствуйте!   Компания \"АВС-Дорстрой\" приглашает в команду Backend-разработчика для работы над магазином стройматериалов и сервисом доставки спецтехники.   В этой роли ты будешь:   - Участвовать в разработке новых сервисов и доработке существующих продуктов; - Реализовывать фичи от идеи до деплоя - ты будешь видеть результат своего кода “вживую”; - Оптимизировать работу систем, искать узкие места, экспериментировать с решениями.     Технологический стек:   - Golang - Git - GraphQL - PostgreSQL - Docker - Sqlc   Обязанности:   - Разработка бизнес-логики с использованием Golang. - Реализация API на базе GraphQL. - Оптимизация SQL запросов.   УДАЛЕНКИ НЕТ!!!   Если вы готовы присоединиться к нашей команде и работать над интересными проектами, ждем вашего отклика!",
      "skills": [],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:20:02.338Z"
    },
    {
      "id": "96396728",
      "title": "Golang-разработчик в DevPlatform",
      "url": "https://hh.ru/vacancy/96396728?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Т-Банк. ИТ. Разработка",
        "url": "https://hh.ru/employer/78638?dpt=78638-78638-develop&hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "DevPlatform — новый внутренний продукт Т-Банка. Мы создали его, чтобы стандартизировать и формализовать лучшие практики поставки ИТ-ценности в Т-Банк. Наша цель — дать разработчикам удобный набор инструментов для написания кода, запуска тестов и деплоя в продакшен, который поможет им сфокусироваться на создании новых продуктов и фич, а не на изучении DevOps. Мы ищем Golang-разработчика, который займется разработкой системы Distributed Tracing на основе открытых компонентов (Jaeger / OpenTelemetery Collector / Cassandra). Под разработкой мы понимаем: — продуктизацию сервисов сбора и хранения трейсов; — создание подходящих под задачу алгоритмов хвостового семплирования; — создание системы динамического управления проектными квотами, которая позволит нам сохранять полезные трейсы и отбрасывать заурядные.   Обязанности:  Разрабатывать инфраструктурный сервис для сбора распределенных трейсов Заниматься дизайном и имплементацией подходов к управлению нагрузкой: QoS на пропускную способность, динамическое/адаптивное семплирование и так далее Разрабатывать подходы к обеспечению надежности системы сбора трейсов, определять SLO/SLI Участвовать во внедрении распределенного трейсинга, в том числе в создании каталога согласованных библиотек инструментализации под технологический радар Т-Банк.    Требования:  У вас есть опыт промышленной разработки на Go. Опыт с Java, Kotlin и C++ будет плюсом Понимаете принципы архитектуры многокомпонентных систем — балансировку нагрузки, обеспечение отказоустойчивости и так далее — и умеете применять эти знания на практике Знаете экосистему CloudNative: K8s, Prometheus и Jaeger Умеете работать с Cassandra, Elasticsearch, ClickHouse и Kafka, в том числе сайзить инфраструктуру    Мы предлагаем:  Возможность работы в аккредитованной ИТ-компании. Достойная твоего профессионального уровня зарплата, размер обсудим на собеседовании Профессиональное развитие: проводим митапы, тренинги и мастер-классы Гибридный формат работы Гибкий рабочий график с началом работы с 8:00 до 11:00 Компенсация обедов Забота о здоровье: полис ДМС со стоматологией и страховка от несчастных случаев для тебя и льготные условия страхования для близких Компенсация затрат на спорт.",
      "skills": [],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:20:28.879Z"
    },
    {
      "id": "129377169",
      "title": "Golang Developer (PF)",
      "url": "https://hh.ru/vacancy/129377169?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "RecPlace",
        "url": "https://hh.ru/employer/10575675?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Краснодар, Клиническая улица, 4",
      "description": "RecPlace - это инновационная SaaS платформа, направленная на полную автоматизацию маркетинговых процессов малого бизнеса на онлайн картах (Яндекс Карты, 2GIS и т.д.)RecPlace сегодня:Облачная платформа, которой доверяют 7000+ предпринимателей и 400+ агентств.Аккредитованная IT-компания.Наши партнеры - ПроДокторов, Авито, Точка Банк и другие крупные компании.Команда из 50+ профессионалов, которые ежедневно создают решения и генерируют идеи для развития маркетинга.Резидент Сколково, участник акселераторов ФРИИ, Сбера.Наша цель – сделать передовые технологии доступными для всех. Сейчас мы расширяемся и ищем Golang-разработчика (узконаправленный разработчик PF), который поможет нам автоматизировать сложные браузерные процессы и развивать архитектуру наших backend-решений.Мы предлагаем:Прозрачная система мотивации, обсуждается с финальным кандидатомОфициальное трудоустройство по ТК РФ в IT-компаниюПятидневная рабочая неделя с выходными - суббота, воскресеньеПолностью белая зарплата, выплаты дважды в месяцВозможность работать с реальными задачами в области ИИ и автоматизацииУчастие в инновационных проектах с поддержкой от государстваКорпоративные мероприятия за счет компании (обучение, корпоративы, конкурсы, праздники, внутренняя бонусная программа).Получение всех льгот, которые дает работа в IT-компании (отсрочка от службы, IT-ипотека)Чем предстоит заниматься:Разработка решений, имитирующих поведение пользователя в браузереИнтеграция с прокси-серверами и управление браузерными сессиямиПоддержка отказоустойчивых микросервисов на GoОптимизация и профилирование кодаУчастие в архитектурных обсуждениях, соблюдение внутренних стандартов (git flow, code review и т.п.)Что для нас важно:Опыт коммерческой разработки от 2 летОтличное знание Golang (другие языки приветствуются)Понимание многопоточности и конкурентного программированияУмение разбираться в cookies, fingerprint, сессиях, заголовках, proxy-системахОпыт с CEF, energy, Puppeteer, Selenium или аналогамиУверенное использование Linux и командной строкиНавыки работы с Docker, Git, брокерами сообщений (NATS / RabbitMQ)Профилирование и оптимизация Go-приложенийТехнический английский (для чтения документации)Будет плюсом:Опыт работы с Tesseract или другими OCR-движкамиЗнание Redis, MongoDB, aiohttp/FastAPI/asyncioНавыки работы с OpenCV или аналогамиЗнание gRPC, CI/CD, базовые принципы DDDСамоорганизация, инициативность, стремление к развитиюЕсли вам интересны технологические вызовы и задачи, связанные с автоматизацией браузеров, архитектурой и оптимизацией – откликайтесь, будем рады познакомиться!При отклике укажите, пожалуйста, ваши ожидания по заработной плате.",
      "skills": [
        "Golang",
        "REST API",
        "Python",
        "Git",
        "Docker",
        "Redis"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:20:35.833Z"
    },
    {
      "id": "129407753",
      "title": "Middle Python/Golang-разработчик (ИБ)",
      "url": "https://hh.ru/vacancy/129407753?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "СОГАЗ: г. Москва",
        "url": "https://hh.ru/employer/955?dpt=955-955-msk&hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Москва, Красные ворота, Сретенский бульвар, Тургеневская, Чистые пруды, Уланский переулок, 24с1",
      "description": "Хотите стать частью увлекательного процесса цифровой трансформации?Блок ИБ в СОГАЗ активно развивается. Мы создаем новые решения, которые делают нашу работу более технологичной и эффективной. Сейчас мы в поиске разработчика Python/Golang. Чем предстоит заниматься:  Полный цикл разработки ПО; Автоматизация задач дирекции информационной безопасности; Поддержка существующей кодовой базы и решений дирекции (сканеры уязвимостей, прикладной софт для автоматизации)  Мы ждем, что вы:   Имеете опыт коммерческой разработки от 3-х лет;   Комфортно чувствуете себя с Python и Go, сможете исправить баг в другом ЯП;   Знаете принципы ООП и имеете опыт разработки многопоточных приложений;   Умеете работать с базами данных и брокерами сообщений;   Умеете работать в Linux, использовать docker, git, можете выйти из vim;   Работали с API, знаете принципы REST;   Знакомы с TCP/IP, знаете основные сетевые протоколы и умеете работать с ними.   Будет плюсом:  Интерес к сфере информационной безопасности; Опыт разработки в ИБ; Знание алгоритмов обработки данных; Опыт с Kubernetes; Платина в Elden Ring :D; Пониманием CI/CD и SDLC-процессов  Мы предлагаем:  Оформление полностью в соответствии с ТК РФ; Заботу компании о вашем здоровье: ДМС со стоматологией в лучших клиниках страны; Премиальные условия на все виды страхования в «СОГАЗе» для вас и близких родственников; Собственный фитнес-центр в офисе в центре Москвы (новейшее уникальное оборудование Milon для «умных» тренировок); Возможность проходить внешнее обучение после успешного прохождения испытательного срока, а также обучаться на курсах нашего корпоративного портала; Заботу компании о детях сотрудника: скидки в детские лагеря и подарки на Новый год; Реальные возможности профессионального и карьерного роста; Настрой на долгосрочное сотрудничество: будем для вас гарантом стабильности; Формат работы из офиса компании в пешей доступности от м. Чистые пруды/Тургеневская/Сретенский бульвар), а после испытательного срока - возможность гибрида",
      "skills": [],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:22:00.453Z"
    },
    {
      "id": "129943811",
      "title": "Go-разработчик",
      "url": "https://hh.ru/vacancy/129943811?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ИП Росляков Эдуард Витальевич",
        "url": "https://hh.ru/employer/11761178?hhtmFrom=vacancy"
      },
      "salary": {
        "from": 100000,
        "to": 210000,
        "currency": "RUB",
        "gross": false
      },
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Присоединяйтесь к нашей команде Go-разработчиков! Вы увлечены программированием и хотите развиваться в динамичной и инновационной среде? Мы ищем талантливого Go-разработчика, который поможет нам создавать передовые решения и улучшать наши продукты. Обязанности:  Разработка и поддержка нагруженных приложений на Go. Участие в проектировании архитектуры программного обеспечения. Оптимизация и рефакторинг существующего кода. Взаимодействие с командой для достижения общих целей проекта. Написание тестов и участие в код-ревью.  Требования:  Опыт работы с Go от 1 до 3 лет. Знание принципов ООП и паттернов проектирования. Умение работать с системами контроля версий (Git). Опыт работы с RESTful API и микросервисной архитектурой. Способность к быстрому обучению и адаптации к новым технологиям.  Условия и преимущества:  Полная занятость с графиком 5/2. Удалённая работа с гибким началом рабочего дня. Возможности для профессионального роста и развития. Дружелюбная и поддерживающая команда.",
      "skills": [
        "Git",
        "Linux",
        "Docker",
        "Паттерны проектирования",
        "Golang",
        "Docker-compose",
        "MongoDB",
        "MySQL",
        "PostgreSQL",
        "Amazon Web Services",
        "NoSQL",
        "Redis",
        "Tarantool",
        "Apache Kafka",
        "Grafana",
        "Prometheus",
        "Clean Architecture",
        "Nginx",
        "SSH",
        "REST API",
        "JSON API",
        "Swagger"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:23:55.516Z"
    },
    {
      "id": "129750471",
      "title": "PHP/Go Developer",
      "url": "https://hh.ru/vacancy/129750471?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Voximplant",
        "url": "https://hh.ru/employer/941273?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Москва, Тульская, Шаболовская, Мытная улица, 66",
      "description": "Привет, это Voximplant! Мы создаем сервисы для коммуникаций, с помощью которых разработчики и бизнесы улучшают клиентский опыт. Для этого у нас есть два продукта: Voximplant Platform помогает разработчикам улучшать свои продукты с помощью телефонии, голосовых AI агентов и текстовых коммуникаций; а Voximplant Kit дает возможность бизнесам настроить облачный контакт-центр за 30 минут и автоматизировать общение с клиентами с помощью искусственного интеллекта. Наши клиенты – российские и международные стартапы и крупные компании, например: МВидео, Детский Мир, Яндекс, Самокат, Сбер, Авито, Битрикс24, СДЭК.   О Voximplant в 2026 году:  С 2013 года на рынке облачных коммуникаций 290+ сотрудников 30 000 клиентов по всему миру 2 млрд звонков обрабатываем в год    И сейчас мы находимся в поиске PHP/Go Developer.   Чем ты будешь заниматься:  API и сервисы для Voximplant Kit Написание и поддержка сервисов на Golang Написание, отладка и оптимизация запросов к базе данных (аналитика/выгрузки) Участие в проектировании отказоустойчивой архитектуры приложения Бекэнд для сайта и портала документации (CRUD API + поиск) Панель администрирования сайта и документации Бекэнд для внутренних утилит и сервисов    Стек технологий:  PHP 8.1 Go Nginx 1.17 + PHP-FPM YII 2 (переезд на Symfony + Roadrunner/Swoole/etc) / Symfony 4 PostgreSQL 14 (и немного Mysql 5.7 / DynamoDB) Redis Redis Pub/Sub RabbitMQ Git, Gitlab Docker для разработки Ansible Немного K8s    Кого мы ищем:  Опыт разработки на PHP: знание принципов ООП, желание и способность писать чистый код Будет круто, если есть опыт разработки на Golang или хотя бы поверхностное знакомство и сильное желание с ним поработать Уверенное владение SQL Готовность покрывать свой код тестами и сопровождать минимально необходимой документацией Использование Xdebug в работе Плюсом будет знакомство с WebSocket/SSE Знание что такое Docker и умение им пользоваться Опыт работы с трекерами (у нас - Jira) Достаточная сила воли, чтобы писать комментарии к коммитам Английский, достаточный для чтения документации, stackoverflow и адекватного именования методов/классов/переменных.    Почему тебе у нас понравится:   Мы - продуктовая компания, которая создает технически сложный и востребованный продукт для бизнеса   Гибкое начало рабочего дня   Работа в аккредитованной IT-компании   Нет лишней бюрократии и хаоса   Одна из 2-х льгот на выбор за счет компании (с возможностью воспользоваться другой на корпоративных условиях):  ДМС (Лучи) Корпоративное обучение английскому/испанскому языку до 2-х раз в неделю    Корпоративные скидки от BestBenefits   Московский офис находится в пяти минутах от метро Тульская, рядом с Даниловским рынком   Современные и удобные инструменты, софт и оборудование для работы",
      "skills": [
        "PHP",
        "Symfony",
        "Golang",
        "Yii"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:31:14.877Z"
    },
    {
      "id": "129654200",
      "title": "Специалист по Веб-технологиям (команда Go-разработчиков)",
      "url": "https://hh.ru/vacancy/129654200?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "НеоБИТ",
        "url": "https://hh.ru/employer/802210?hhtmFrom=vacancy"
      },
      "salary": {
        "from": 150000,
        "to": null,
        "currency": "RUB",
        "gross": false
      },
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Санкт-Петербург, Политехническая, улица Обручевых, 1",
      "description": "Мы ищем близкого по духу человека в небольшое конструкторское IT-бюро. Идеальный кандидат: ИБ-специалист с опытом разработки на Golang и Python (OSINT, Антифрод). Если ты экспериментатор по натуре, то нам по пути!Чем предстоит заниматься:  Автоматизировать и упрощать работу технических специалистов. Проектировать, разрабатывать и поддерживать ПО на Golang (и иногда Python). Проектировать БД. Участвовать в развертывании проектов в инфраструктуре заказчика. Активно взаимодействовать с участниками команды. Систематизировать и писать документацию по проектам. Прорабатывать гипотезы, реализовывать и интегрировать успешные.  От тебя ждем:  Опыт проектирования архитектуры на уровне приложений. Высшее образование (ИТ, информационная безопасность). Уверенные знания одного или нескольких языков программирования (Golang, Python, TypeScript, C#, C/C++, Kotlin). Опыт и знание принципов работы с реляционными и нереляционными базами данных (PostreSQL, ClickHouse, ES, redis etc.). Опыт работы с системами контейнеризация и/или виртуализации (Docker, Kubernets, KVM etc). Опыт создания пользовательских и эксплуатационных документов. Опыт работы с телеграмм-ботами. Опыт написания скриптов сбора информации и анализа данных, парсинга HTML. Понимание принципов OSINT-разведки: сбор открытых данных, поиск по цифровым следам, корреляция информации.  Будет большим плюсом  Управленческие и лидерские навыки (Soft Skills). Базовое понимание anti-fraud логики: паттерны мошеннических действий, анализ транзакций, поведенческие признаки, фрод-маркеры. Опыт работы с графовыми БД (например, с Neo4j, NebulaGraph, ArangoDB). Опыт в построении собственных пайплайнов сбора данных (например, через Airflow, Kafka, или самописные ETL-процессы). Опыт интеграции ML-моделей в процессы обработки данных. Системность. Знания быстро устаревают, нужно быстро ориентироваться, что, где и когда нужно обновить информацию. Самоорганизованность. Лучшие условия и возможности ты создаешь сам. Любопытство. Широкий кругозор и разносторонность - наши неотъемлемые качества.  ✅Что предлагаем  Интереснейшие проекты в работе, от проекта к проекту - новые задачи и решения. Работа в уютном офисе в 5-и минутах пешком от м. Политехническая. Гибкое начало рабочего дня с 09:00 до 11:00. В нашей команде есть и \"жаворонки\" и \"совы\". По согласованию с командой можно выбрать удобный график работы. Все белым-бело. Никаких конвертов. Больничные, отпуска, ну в общем все как обычно в серьезных компаниях. 100% компенсация больничных. Внушительная годовая премия. Профессиональное развитие (нестандартные задачи, передовые технологии, обмен опытом внутри компании, возможность посещения крупнейших отраслевых конференций). Мы уделяем внимание здоровью. У нас действует программа ДМС со стоматологией. Мы за любые активности. Каждую пятницу - волейбол, а по средам - йога. Для тех, кто предпочитает тренажерный зал, предусмотрена частичная компенсация спортивных абонементов. Чай и кофе для сотрудников, оборудованная зона для питания. Неравнодушная команда, где не игнорируют вопросы, а готовы помочь.",
      "skills": [
        "Golang",
        "Linux",
        "SQL",
        "REST",
        "Go",
        "PostgreSQL",
        "Git",
        "Разработка ПО",
        "Английский — B1 — Средний"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:31:48.619Z"
    },
    {
      "id": "129626906",
      "title": "Ведущий инженер-программист / Разработчик GO",
      "url": "https://hh.ru/vacancy/129626906?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ООО Центр Информационных Технологий БАРС",
        "url": "https://hh.ru/employer/1020927?hhtmFrom=vacancy"
      },
      "salary": {
        "from": 150000,
        "to": null,
        "currency": "RUB",
        "gross": false
      },
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Ижевск, Пушкинская улица, 268",
      "description": "Мы Центр Информационных Технологий БАРС – российская вендорная ИТ-компания. Более 20 лет разрабатываем цифровые системы для госучреждений и международных предприятий. Наши основные направления деятельности: БАРС - Имущество — автоматизация задач органов управления имуществом.  Входит в ТОП-3 программных решений России по автоматизации управления имуществом и земельными ресурсами. Более 1790 лицензий на территории РФ.  ГЛОБАРС — многофункциональная система спутникового мониторинга автотранспорта, любых мобильных и стационарных объектов.  Более 200000 подключенных объектов в РФ и за границей.  Панель руководителя — мультитенантное облачное решение предоставляет собственникам и руководителям организаций аналитическую информацию о текущем состоянии бизнеса и его динамике в прошлом. Сейчас мы в поисках Golang разработчика в нашу команду, способного быстро погрузиться в новые задачи и усилить нашу команду.   Задачи, над которыми нужно будет работать:  Принятие архитектурных решений; Развитие инженерных практик; Проектирование и разработка продуктов и связанных сервисов; Написание юнит тестов, поддержка тестирования, участие в решении инцидентов; Участие в проведении код ревью; Помощь в техническом развитии GO-разработчиков.  Что мы ждём от кандидата:  Опыт разработки на Golang от 2-х лет; Опыт проектирования микросервисной высоконагруженной архитектуры; Знание технологий и инструментов: RabbitMQ, Redis, REST API, Docker, Git; Желателен опыт работы с БД MongoDB; k8s, Gitlab CI/CD, gRPC, опыт администрирования серверов linux, Nginx, опыт работы с Angular; Знание технического английского для чтения документации; Личные качества: целеустремленность, умение работать в команде.  Что мы предлагаем:  Работу в аккредитованной IT-компании; Полностью белую официальную заработную плату, размер обсуждается на собеседовании; 8-часовой рабочий день, 5/2 (работа в офисе, гибрид или удаленка); Гибкий график начала работы: можно выбрать время 8:00-17:00, 8:30-17:30, 9:00-18:00; ДМС; Частичная оплата спорта; Возможность участвовать в профильных конференциях и обучении за счет компании; Работу в современном офисе в центре города с комнатой отдыха, настольным теннисом, турником и настольными играми.    Мы создаём среду, где каждый сотрудник может найти приятного собеседника, друга и единомышленника. Присоединяйся к нам :)",
      "skills": [
        "Golang",
        "PostgreSQL",
        "MongoDB",
        "Linux",
        "Redis",
        "gRPC",
        "CI/CD",
        "Gitlab",
        "Docker",
        "REST API",
        "Nginx"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:32:20.776Z"
    },
    {
      "id": "129606953",
      "title": "Go-developer (микросервисы, финтех)",
      "url": "https://hh.ru/vacancy/129606953?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ООО Реал ИТ",
        "url": "https://hh.ru/employer/11424310?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Мы развиваем современную платформу на микросервисной архитектуре и усиливаем команду. Ищем Go-разработчика, который пишет аккуратный код, умеет работать с сервисами и инфраструктурой, и хочет влиять на развитие продукта вместе с командой. Что предстоит делать:   Разрабатывать микросервисы на Go (Fiber + GORM).   Работать с PostgreSQL и Redis.   Интегрировать сервисы через брокеры сообщений (NATS или Kafka).   Поддерживать и развивать API (Swagger, REST, WebSockets).   Участвовать в проектировании решений и обсуждении технических подходов.   Писать чистый, поддерживаемый код, участвовать в код-ревью.   Работать с Docker, docker-compose, GitLab CI/CD.   При наличии опыта — поддерживать Telegram-ботов на Go.   Мы ждём от вас:   Опыт коммерческой разработки на Go от 1 года.   Хорошее знание Go, Fiber и GORM.   Понимание PostgreSQL и Redis.   Навыки работы в Linux-среде.   Знание Git, GitLab, Jira.   Опыт работы с Docker и docker-compose.   Понимание микросервисной архитектуры.   Навык работы с WebSockets.   Базовое понимание S3-хранилищ.   Плюсом — опыт разработки Telegram-ботов.   Что предлагаем:   Возможность влиять на процессы и технические решения.   Работа в компактной команде инженеров без лишней бюрократии.   Прозрачные задачи и быстрые циклы разработки.   Удаленный формат.   Выплаты 2 раза в месяц.   Оффер по результатам собеседования",
      "skills": [
        "Golang",
        "PostgreSQL",
        "Docker"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:36:30.367Z"
    },
    {
      "id": "129620048",
      "title": "Full-Stack Developer (Go + React)",
      "url": "https://hh.ru/vacancy/129620048?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ИП Биктимиров Тимур Радикович",
        "url": "https://hh.ru/employer/12553356?hhtmFrom=vacancy"
      },
      "salary": {
        "from": 100000,
        "to": 150000,
        "currency": "RUB",
        "gross": false
      },
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Обязанности:  Писать новый функионал на беке Дорабатывать React-компоненты Фиксить баги и улучшать существующий код Работать с PostgreSQL Разбираться в API-документации Твой код сразу идёт в прод и влияет на пользователей Можешь реально влиять на продукт — предлагай фичи, меняй архитектуру Стек: - Backend на Go с gRPC-стримингом - Сайт на Next.js 16 + React 19 + Tailwind CSS 4. - Postgresql - S3 - Интеграция с LLM В стартапе нет жёстких рамок — сегодня пишешь backend, завтра правишь фронт. Прошу не пытаться устроиться на эту работу как на вторую, в стартапе вы будете третьим человеком и вся работа на виду  Требования:  Go - от 6 месяцев коммерческого опыта React + TypeScript — можешь сверстать страницу PostgreSQL - запросы, миграции Docker -запустить, прочитать docker-compose Git Плюсом: gRPC, Next.js Опыт работы с любыми API Работал в стартапе и понимаешь, что это такое (уронил прод, нет подписок, пошли отказы в подписках, нет подписок, нет денег, нет денег - нет денег) Условия: 100 000 - 150 000 ₽ на руки Оплачиваем доступ к нейросетям Claude Code, Codex Полная удалёнка Никаких созвонов ради созвонов - общаемся по делу Плоская структура — говоришь напрямую с владельцем Быстрый рост: через полгода можешь стать ключевым разработчиком Опцион обсуждаем для тех, кто хочет расти вместе с компанией",
      "skills": [
        "Golang",
        "React",
        "PostgreSQL",
        "API",
        "gRPC"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:36:39.343Z"
    },
    {
      "id": "128937757",
      "title": "Go-разработчик (middle)",
      "url": "https://hh.ru/vacancy/128937757?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ООО Интегрированные системы управления",
        "url": "https://hh.ru/employer/5235027?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Москва, Академическая, Профсоюзная, улица Ивана Бабушкина, 16А",
      "description": "Мы — часть группы «Газпромбанка» и аккредитованная IT-компания, создающая российскую no-code платформу Knowledge Space (KS). KS — одна из ведущих no-code систем в России, вошедшая в топ-10 BPM-систем и занявшая 8 место по версии отраслевых рейтингов. Платформа KS помогает крупнейшим компаниям страны эффективно планировать, проектировать и развивать корпоративную архитектуру, объединяя возможности интегрированного планирования и гибких IT-решений. Сейчас мы ищем middle go-разработчика в команду разработки KS - человека, который готов влиять на качество продукта, работать с передовыми технологиями и развиваться вместе с нами Наш основной стек: Go, PostgreSQL, go-kit, GitLab, Git, Redis, Consul, RabbitMQ, NATS, Docker, Docker compose. Чем нужно будет заниматься:  Разрабатывать backend для современной и высокотехнологичной low-code платформы для цифровизации бизнес-процессов Принимать участие в проектировании архитектуры  От кандидата мы ожидаем:  Опыт коммерческой разработки на Go от 3 лет Понимание сетевых протоколов HTTP/HTTPS, TCP, UDP Опыт работы с реляционной СУБД на уверенном уровне, плюсом будет опыт работы именно с PostgreSQL Опыт работы с микросервисной архитектурой  Мы предлагаем:  Мы - аккредитованная IT-компания, все преимущества которой распространяются на наших сотрудников в полном объеме Конкурентный уровень заработной платы Полностью удаленный формат работы из любой локации (но работаем по московскому времени) 3 дополнительных оплачиваемых выходных в год ДМС после испытательного срока, включая стоматологию и психологическую помощь Участие в создании инновационного продукта Интересные задачи, профессиональное развитие Корпоративные мероприятия и тимбилдинги (оффлайн и онлайн)",
      "skills": [
        "Golang",
        "Go",
        "Microservices",
        "PostgreSQL",
        "Git",
        "Redis",
        "Consul",
        "RabbitMQ",
        "Docker"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:37:19.517Z"
    },
    {
      "id": "129649723",
      "title": "Старший Go-разработчик, Группа разработки кредитного биллинга, Ozon Bank",
      "url": "https://hh.ru/vacancy/129649723?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Ozon Банк",
        "url": "https://hh.ru/employer/2180?dpt=ozonru-2180-fintech&hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Ищем Senior Go-разработчика в команду Ozon Банка. Мы строим финтех как IT-продукт и быстро растём. Все самые сложные и важные системы банка реализуем сами, а нашими продуктами и сервисами пользуются частные клиенты и бизнес. Проекты и процессы в банке новые, и каждый может влиять на результат. Мы — команда, которая разрабатывает систему биллинга кредитных продуктов. Кажется, всё просто: человеку выдали кредит → долг увеличивается → в базе к числу прибавляем сумму. Человек погашает часть → долг уменьшается → в базе из числа вычитаем сумму. На самом деле, это сложная система, где каждый платёж — это цепочка событий, а сам продукт несёт риски и строго регулируется законом. Если вам по душе задачи со звёздочкой, то ждём в команде. Вам предстоит: — Кодить механизмы работы с долгом. Обычно долг — это просто int в БД. Для нас же это множество гранул, у каждой из которых есть своё значение и состояние. — Кодить процессор событий, отправляющий точные и своевременные отчёты по состоянию долга в бюро кредитных историй. — Кодить механизмы работы с просроченными долгами, чтобы люди не забывали их возвращать. — Обрабатывать множество крайних кейсов. Например, если заёмщик стал банкротом или попал в тяжёлую жизненную ситуацию и попросил кредитные каникулы. — Работать над бизнес-целями, которые позволят нам зарабатывать ещё больше. Мы ждём, что вы: — Понимаете DDD или готовы изучить на практике. Мы используем как тактические, так и стратегические паттерны. В коде максимально используется доменный язык, и мы стремимся быть на одной волне с бизнесом. — Умеете работать в команде и аргументировать свою позицию. Мы ценим чистоту продукта и общаемся с бизнесом, чтобы предложить максимально правильное решение. — Имеете опыт работы с Go, PostgreSQL (must), Kafka, Kubernetes, GraphQL. У нас современный стек бэкенд-разработки: весь код — на Go, база — PostgreSQL, Kafka — как шина данных, Kubernetes — как среда для деплоя, GitLab, GitLab CI, метрики — в Prometheus, графики — в Grafana и полный набор инструментов для дебага — логи, трейсинг, логи межсервисных запросов.",
      "skills": [
        "Golang",
        "PostgreSQL",
        "Kubernetes",
        "Backend"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:38:20.045Z"
    },
    {
      "id": "129269328",
      "title": "Go-разработчик, Личный кабинет и Избранное",
      "url": "https://hh.ru/vacancy/129269328?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Ozon Tech",
        "url": "https://hh.ru/employer/2180?dpt=ozonru-2180-dev&hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": "Москва, Деловой центр, Деловой центр, Москва-Сити, Пресненская набережная, 10",
      "description": "Наша команда отвечает за разработку таких продуктов Озон как избранное, покупки, вишлисты, личный кабинет покупателя. Также наша команда отвечает за пользовательский опыт — всё, что видят пользователи на указанных выше страницах разрабатывается нашими силами. Результаты работы сразу становятся доступны покупателям.   Вы будете:  Разрабатывать и поддерживать backend высоконагруженных сервисов. Оптимизировать и работать над стабильностью сервисов. Исправлять баги, проводить рефакторинг, писать unit-тесты. Активно взаимодействовать с участниками команды, участвовать в планировании разработки. Взаимодействовать с другими командами.  Нам важно:  Знание основ языка Go и практический опыт работы с ним. Базовые знания основных технологий и протоколов, которые используются в веб-разработке. Знание реляционных БД, например, PostgreSQL. Опыт работы с брокерами сообщений (мы используем Kafka). Опыт работы с Git. Опыт работы с Redis.",
      "skills": [
        "IT",
        "Торговая площадка",
        "Golang"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:40:45.331Z"
    },
    {
      "id": "129380545",
      "title": "AI-разработчик (Python / Go / Frontend)",
      "url": "https://hh.ru/vacancy/129380545?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ООО СП Солюшен",
        "url": "https://hh.ru/employer/11545313?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Кто мы: Мы создаем экосистему сервисов и AI-продуктов, которая уже работает в десятках стран. Наш код двигает миллионы транзакций в день, соединяя людей, системы и данные.Мы растем кратно каждый год и ищем не просто сотрудников — будущих партнеров, которые живут своей работой и хотят влиять на будущее. Принцип простой: Чем успешнее твой проект — тем выше твой доход.Ты не делаешь стартап “в никуда”.Ты получаешь конкретный проект, который после реализации гарантированно зарабатывает деньги.Твоя задача — довести его до идеала и зарабатывать вместе с ним. Кого мы ищем: Мы ищем разработчиков нового поколения — тех, кто уже работает с ИИ или осознанно готов перейти на новый формат разработки. В этой роли ты будешь:  Разрабатывать новые сервисы и улучшать существующие продукты; Реализовывать фичи от идеи до деплоя; Работать с высокими нагрузками и большими объёмами данных; Оптимизировать системы и находить узкие места.  Нам подходят два типа кандидатов: Ты уже работаешь с ИИ:   50%+ кода пишешь с помощью Claude Code, GPT-5 или других моделей;   Строишь собственные AI-пайплайны и автоматизируешь рутину;   Умеешь писать код без ИИ, когда это необходимо.   Ты готов перестроиться:   Понимаешь, что классический подход к программированию устаревает;   Хочешь кратно увеличить эффективность за счёт AI;   Готов быстро войти в новый формат работы и реальные проекты.   Обязательное требование (без исключений):   Практический опыт работы с MCP (Model Context Protocol).   Важно:У нас есть тестовое задание — и это не “проверка ради галочки”.Если ты успешно его выполняешь, ты сразу получаешь оффер и оплату тестового задания при трудоустройстве. Чтобы тебе было максимально комфортно и честно, мы даём доступ к нашему внутреннему обучению по AI-кодингу.Это не базовый курс, а концентрат того, как мы реально пишем код с ИИ, строим пайплайны и работаем с MCP в продакшене. Если ты уже работал с MCP, тестовое обычно решается за ~2-3 часа. Даже если по итогу мы не совпадём, ты уйдёшь с:   новым подходом к AI-кодингу;   практическим пониманием MCP;   навыками, которые можно сразу применять в работе.   Мы предлагаем:  Формат работы: гибрид в Москве или 2-3 месяца удаленки, далее переезд в Москву (релокация с нас); В московском офисе — PlayStation, вкусный китайский чай и живая атмосфера, но можно работать и из любой точки мира; Гибкий график: важны результаты и ответственность, а не строгие рамки; Прозрачная система вознаграждения: фикс + бонусы за результат + премии за креативные решения; Совместные выезды в тёплые страны, тимбилдинги, корпоративы и спортивные выходные всей командой; Участие в международных выставках и митапах (Дубай, Ереван, Москва и другие); Возможность возмещения тренажерного зала, курсов; Мы ценим инициативу: можешь оптимизировать процессы или предлагать новое — всегда поддержим и поощрим; Твоя зп и рост в компании прямо пропорциональны твоему профессиональному вкладу и вовлеченности в продукт (у нас минимум текучки и у каждого своя история роста в компании).",
      "skills": [
        "Docker",
        "REST API",
        "Python",
        "SQL",
        "Высоконагруженные системы",
        "Работа с большими данными",
        "Чистый код (Clean Code)",
        "Работа с легаси-кодом",
        "Git",
        "Искусственный интеллект",
        "AI-инструменты разработки",
        "Claude",
        "GPT-5 / OpenAI API",
        "AI-coding",
        "AI-пайплайны",
        "Автоматизация разработки",
        "Golang",
        "CI/CD",
        "Продуктовое мышление",
        "Инициативность",
        "Самостоятельность",
        "Быстрое обучение",
        "Разработка с нуля"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:45:11.280Z"
    },
    {
      "id": "129380546",
      "title": "AI-разработчик (Python / Go / Frontend)",
      "url": "https://hh.ru/vacancy/129380546?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ООО СП Солюшен",
        "url": "https://hh.ru/employer/11545313?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Кто мы: Мы создаем экосистему сервисов и AI-продуктов, которая уже работает в десятках стран. Наш код двигает миллионы транзакций в день, соединяя людей, системы и данные.Мы растем кратно каждый год и ищем не просто сотрудников — будущих партнеров, которые живут своей работой и хотят влиять на будущее. Принцип простой: Чем успешнее твой проект — тем выше твой доход.Ты не делаешь стартап “в никуда”.Ты получаешь конкретный проект, который после реализации гарантированно зарабатывает деньги.Твоя задача — довести его до идеала и зарабатывать вместе с ним. Кого мы ищем: Мы ищем разработчиков нового поколения — тех, кто уже работает с ИИ или осознанно готов перейти на новый формат разработки. В этой роли ты будешь:  Разрабатывать новые сервисы и улучшать существующие продукты; Реализовывать фичи от идеи до деплоя; Работать с высокими нагрузками и большими объёмами данных; Оптимизировать системы и находить узкие места.  Нам подходят два типа кандидатов: Ты уже работаешь с ИИ:   50%+ кода пишешь с помощью Claude Code, GPT-5 или других моделей;   Строишь собственные AI-пайплайны и автоматизируешь рутину;   Умеешь писать код без ИИ, когда это необходимо.   Ты готов перестроиться:   Понимаешь, что классический подход к программированию устаревает;   Хочешь кратно увеличить эффективность за счёт AI;   Готов быстро войти в новый формат работы и реальные проекты.   Обязательное требование (без исключений):   Практический опыт работы с MCP (Model Context Protocol).   Важно:У нас есть тестовое задание — и это не “проверка ради галочки”.Если ты успешно его выполняешь, ты сразу получаешь оффер и оплату тестового задания при трудоустройстве. Чтобы тебе было максимально комфортно и честно, мы даём доступ к нашему внутреннему обучению по AI-кодингу.Это не базовый курс, а концентрат того, как мы реально пишем код с ИИ, строим пайплайны и работаем с MCP в продакшене. Если ты уже работал с MCP, тестовое обычно решается за ~2-3 часа. Даже если по итогу мы не совпадём, ты уйдёшь с:   новым подходом к AI-кодингу;   практическим пониманием MCP;   навыками, которые можно сразу применять в работе.   Мы предлагаем:  Формат работы: гибрид в Москве или 2-3 месяца удаленки, далее переезд в Москву (релокация с нас); В московском офисе — PlayStation, вкусный китайский чай и живая атмосфера, но можно работать и из любой точки мира; Гибкий график: важны результаты и ответственность, а не строгие рамки; Прозрачная система вознаграждения: фикс + бонусы за результат + премии за креативные решения; Совместные выезды в тёплые страны, тимбилдинги, корпоративы и спортивные выходные всей командой; Участие в международных выставках и митапах (Дубай, Ереван, Москва и другие); Возможность возмещения тренажерного зала, курсов; Мы ценим инициативу: можешь оптимизировать процессы или предлагать новое — всегда поддержим и поощрим; Твоя зп и рост в компании прямо пропорциональны твоему профессиональному вкладу и вовлеченности в продукт (у нас минимум текучки и у каждого своя история роста в компании).",
      "skills": [
        "Docker",
        "REST API",
        "Python",
        "SQL",
        "Высоконагруженные системы",
        "Работа с большими данными",
        "Чистый код (Clean Code)",
        "Работа с легаси-кодом",
        "Git",
        "Искусственный интеллект",
        "AI-инструменты разработки",
        "Claude",
        "GPT-5 / OpenAI API",
        "AI-coding",
        "AI-пайплайны",
        "Автоматизация разработки",
        "Golang",
        "CI/CD",
        "Продуктовое мышление",
        "Инициативность",
        "Самостоятельность",
        "Быстрое обучение",
        "Разработка с нуля"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:45:15.737Z"
    },
    {
      "id": "129380547",
      "title": "AI-разработчик (Python / Go / Frontend)",
      "url": "https://hh.ru/vacancy/129380547?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ООО СП Солюшен",
        "url": "https://hh.ru/employer/11545313?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Кто мы: Мы создаем экосистему сервисов и AI-продуктов, которая уже работает в десятках стран. Наш код двигает миллионы транзакций в день, соединяя людей, системы и данные.Мы растем кратно каждый год и ищем не просто сотрудников — будущих партнеров, которые живут своей работой и хотят влиять на будущее. Принцип простой: Чем успешнее твой проект — тем выше твой доход.Ты не делаешь стартап “в никуда”.Ты получаешь конкретный проект, который после реализации гарантированно зарабатывает деньги.Твоя задача — довести его до идеала и зарабатывать вместе с ним. Кого мы ищем: Мы ищем разработчиков нового поколения — тех, кто уже работает с ИИ или осознанно готов перейти на новый формат разработки. В этой роли ты будешь:  Разрабатывать новые сервисы и улучшать существующие продукты; Реализовывать фичи от идеи до деплоя; Работать с высокими нагрузками и большими объёмами данных; Оптимизировать системы и находить узкие места.  Нам подходят два типа кандидатов: Ты уже работаешь с ИИ:   50%+ кода пишешь с помощью Claude Code, GPT-5 или других моделей;   Строишь собственные AI-пайплайны и автоматизируешь рутину;   Умеешь писать код без ИИ, когда это необходимо.   Ты готов перестроиться:   Понимаешь, что классический подход к программированию устаревает;   Хочешь кратно увеличить эффективность за счёт AI;   Готов быстро войти в новый формат работы и реальные проекты.   Обязательное требование (без исключений):   Практический опыт работы с MCP (Model Context Protocol).   Важно:У нас есть тестовое задание — и это не “проверка ради галочки”.Если ты успешно его выполняешь, ты сразу получаешь оффер и оплату тестового задания при трудоустройстве. Чтобы тебе было максимально комфортно и честно, мы даём доступ к нашему внутреннему обучению по AI-кодингу.Это не базовый курс, а концентрат того, как мы реально пишем код с ИИ, строим пайплайны и работаем с MCP в продакшене. Если ты уже работал с MCP, тестовое обычно решается за ~2-3 часа. Даже если по итогу мы не совпадём, ты уйдёшь с:   новым подходом к AI-кодингу;   практическим пониманием MCP;   навыками, которые можно сразу применять в работе.   Мы предлагаем:  Формат работы: гибрид в Москве или 2-3 месяца удаленки, далее переезд в Москву (релокация с нас); В московском офисе — PlayStation, вкусный китайский чай и живая атмосфера, но можно работать и из любой точки мира; Гибкий график: важны результаты и ответственность, а не строгие рамки; Прозрачная система вознаграждения: фикс + бонусы за результат + премии за креативные решения; Совместные выезды в тёплые страны, тимбилдинги, корпоративы и спортивные выходные всей командой; Участие в международных выставках и митапах (Дубай, Ереван, Москва и другие); Возможность возмещения тренажерного зала, курсов; Мы ценим инициативу: можешь оптимизировать процессы или предлагать новое — всегда поддержим и поощрим; Твоя зп и рост в компании прямо пропорциональны твоему профессиональному вкладу и вовлеченности в продукт (у нас минимум текучки и у каждого своя история роста в компании).",
      "skills": [
        "Docker",
        "REST API",
        "Python",
        "SQL",
        "Высоконагруженные системы",
        "Работа с большими данными",
        "Чистый код (Clean Code)",
        "Работа с легаси-кодом",
        "Git",
        "Искусственный интеллект",
        "AI-инструменты разработки",
        "Claude",
        "GPT-5 / OpenAI API",
        "AI-coding",
        "AI-пайплайны",
        "Автоматизация разработки",
        "Golang",
        "CI/CD",
        "Продуктовое мышление",
        "Инициативность",
        "Самостоятельность",
        "Быстрое обучение",
        "Разработка с нуля"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:45:19.029Z"
    },
    {
      "id": "122221994",
      "title": "Golang-разработчик в информационную безопасность",
      "url": "https://hh.ru/vacancy/122221994?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "Т-Банк. ИТ. Разработка",
        "url": "https://hh.ru/employer/78638?dpt=78638-78638-develop&hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Безопасность — часть нашего бизнеса, поэтому мы создаем продукты, следуя принципу security by design. Мы открыты и защищаем не только себя, но и партнеров.Мы ищем Golang-разработчика в направление разработки высоконагруженных продуктов и платформ Информационной Безопасности (CyberSecurity).   Требования:  Опыт разработки на golang  Опыт разработки многопоточных приложений Опыт разработки web-сервисов (REST, gRPC, WebSocket) Опыт работы с реляционными базами данных (преимущественно postgresql) Опыт работы с нереляционными базами данных Опыт работы с брокерами сообщений (преимущественно kafka) Владение инструментами CI/CD и автоматического деплоя Опыт работы с инструментами мониторинга (prometheus, grafana) Опыт работы с unix-системами Будет плюсом опыт реализации high-load решений Будет плюсом опыт проектирования и разработки решений в области информационной безопасности Будет плюсом опыт разработки продуктов на базе открытых решений    Обязанности:  Разработка нагруженных backend-приложений Участие в проектировании внутреннней архитектуры приложений и code review Разработка unit-тестов Проработка метрик в приложении для дальнешей настройки мониторинга и алертинга Участие в системном анализе Участие в проработке и принятии архитектурных решений    Мы предлагаем:  Возможность работы в аккредитованной ИТ-компании. Достойная твоего профессионального уровня зарплата, размер обсудим на собеседовании Профессиональное развитие: проводим митапы, тренинги и мастер-классы Гибридный формат работы Гибкий рабочий график с началом работы с 8:00 до 11:00 Компенсация обедов Забота о здоровье: полис ДМС со стоматологией и страховка от несчастных случаев для тебя и льготные условия страхования для близких Компенсация затрат на спорт.",
      "skills": [],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:46:07.969Z"
    },
    {
      "id": "129380548",
      "title": "AI-разработчик (Python / Go / Frontend)",
      "url": "https://hh.ru/vacancy/129380548?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ООО СП Солюшен",
        "url": "https://hh.ru/employer/11545313?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Кто мы: Мы создаем экосистему сервисов и AI-продуктов, которая уже работает в десятках стран. Наш код двигает миллионы транзакций в день, соединяя людей, системы и данные.Мы растем кратно каждый год и ищем не просто сотрудников — будущих партнеров, которые живут своей работой и хотят влиять на будущее. Принцип простой: Чем успешнее твой проект — тем выше твой доход.Ты не делаешь стартап “в никуда”.Ты получаешь конкретный проект, который после реализации гарантированно зарабатывает деньги.Твоя задача — довести его до идеала и зарабатывать вместе с ним. Кого мы ищем: Мы ищем разработчиков нового поколения — тех, кто уже работает с ИИ или осознанно готов перейти на новый формат разработки. В этой роли ты будешь:  Разрабатывать новые сервисы и улучшать существующие продукты; Реализовывать фичи от идеи до деплоя; Работать с высокими нагрузками и большими объёмами данных; Оптимизировать системы и находить узкие места.  Нам подходят два типа кандидатов: Ты уже работаешь с ИИ:   50%+ кода пишешь с помощью Claude Code, GPT-5 или других моделей;   Строишь собственные AI-пайплайны и автоматизируешь рутину;   Умеешь писать код без ИИ, когда это необходимо.   Ты готов перестроиться:   Понимаешь, что классический подход к программированию устаревает;   Хочешь кратно увеличить эффективность за счёт AI;   Готов быстро войти в новый формат работы и реальные проекты.   Обязательное требование (без исключений):   Практический опыт работы с MCP (Model Context Protocol).   Важно:У нас есть тестовое задание — и это не “проверка ради галочки”.Если ты успешно его выполняешь, ты сразу получаешь оффер и оплату тестового задания при трудоустройстве. Чтобы тебе было максимально комфортно и честно, мы даём доступ к нашему внутреннему обучению по AI-кодингу.Это не базовый курс, а концентрат того, как мы реально пишем код с ИИ, строим пайплайны и работаем с MCP в продакшене. Если ты уже работал с MCP, тестовое обычно решается за ~2-3 часа. Даже если по итогу мы не совпадём, ты уйдёшь с:   новым подходом к AI-кодингу;   практическим пониманием MCP;   навыками, которые можно сразу применять в работе.   Мы предлагаем:  Формат работы: гибрид в Москве или 2-3 месяца удаленки, далее переезд в Москву (релокация с нас); В московском офисе — PlayStation, вкусный китайский чай и живая атмосфера, но можно работать и из любой точки мира; Гибкий график: важны результаты и ответственность, а не строгие рамки; Прозрачная система вознаграждения: фикс + бонусы за результат + премии за креативные решения; Совместные выезды в тёплые страны, тимбилдинги, корпоративы и спортивные выходные всей командой; Участие в международных выставках и митапах (Дубай, Ереван, Москва и другие); Возможность возмещения тренажерного зала, курсов; Мы ценим инициативу: можешь оптимизировать процессы или предлагать новое — всегда поддержим и поощрим; Твоя зп и рост в компании прямо пропорциональны твоему профессиональному вкладу и вовлеченности в продукт (у нас минимум текучки и у каждого своя история роста в компании).",
      "skills": [
        "Docker",
        "REST API",
        "Python",
        "SQL",
        "Высоконагруженные системы",
        "Работа с большими данными",
        "Чистый код (Clean Code)",
        "Работа с легаси-кодом",
        "Git",
        "Искусственный интеллект",
        "AI-инструменты разработки",
        "Claude",
        "GPT-5 / OpenAI API",
        "AI-coding",
        "AI-пайплайны",
        "Автоматизация разработки",
        "Golang",
        "CI/CD",
        "Продуктовое мышление",
        "Инициативность",
        "Самостоятельность",
        "Быстрое обучение",
        "Разработка с нуля"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:46:21.992Z"
    },
    {
      "id": "129380549",
      "title": "AI-разработчик (Python / Go / Frontend)",
      "url": "https://hh.ru/vacancy/129380549?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ООО СП Солюшен",
        "url": "https://hh.ru/employer/11545313?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Кто мы: Мы создаем экосистему сервисов и AI-продуктов, которая уже работает в десятках стран. Наш код двигает миллионы транзакций в день, соединяя людей, системы и данные.Мы растем кратно каждый год и ищем не просто сотрудников — будущих партнеров, которые живут своей работой и хотят влиять на будущее. Принцип простой: Чем успешнее твой проект — тем выше твой доход.Ты не делаешь стартап “в никуда”.Ты получаешь конкретный проект, который после реализации гарантированно зарабатывает деньги.Твоя задача — довести его до идеала и зарабатывать вместе с ним. Кого мы ищем: Мы ищем разработчиков нового поколения — тех, кто уже работает с ИИ или осознанно готов перейти на новый формат разработки. В этой роли ты будешь:  Разрабатывать новые сервисы и улучшать существующие продукты; Реализовывать фичи от идеи до деплоя; Работать с высокими нагрузками и большими объёмами данных; Оптимизировать системы и находить узкие места.  Нам подходят два типа кандидатов: Ты уже работаешь с ИИ:   50%+ кода пишешь с помощью Claude Code, GPT-5 или других моделей;   Строишь собственные AI-пайплайны и автоматизируешь рутину;   Умеешь писать код без ИИ, когда это необходимо.   Ты готов перестроиться:   Понимаешь, что классический подход к программированию устаревает;   Хочешь кратно увеличить эффективность за счёт AI;   Готов быстро войти в новый формат работы и реальные проекты.   Обязательное требование (без исключений):   Практический опыт работы с MCP (Model Context Protocol).   Важно:У нас есть тестовое задание — и это не “проверка ради галочки”.Если ты успешно его выполняешь, ты сразу получаешь оффер и оплату тестового задания при трудоустройстве. Чтобы тебе было максимально комфортно и честно, мы даём доступ к нашему внутреннему обучению по AI-кодингу.Это не базовый курс, а концентрат того, как мы реально пишем код с ИИ, строим пайплайны и работаем с MCP в продакшене. Если ты уже работал с MCP, тестовое обычно решается за ~2-3 часа. Даже если по итогу мы не совпадём, ты уйдёшь с:   новым подходом к AI-кодингу;   практическим пониманием MCP;   навыками, которые можно сразу применять в работе.   Мы предлагаем:  Формат работы: гибрид в Москве или 2-3 месяца удаленки, далее переезд в Москву (релокация с нас); В московском офисе — PlayStation, вкусный китайский чай и живая атмосфера, но можно работать и из любой точки мира; Гибкий график: важны результаты и ответственность, а не строгие рамки; Прозрачная система вознаграждения: фикс + бонусы за результат + премии за креативные решения; Совместные выезды в тёплые страны, тимбилдинги, корпоративы и спортивные выходные всей командой; Участие в международных выставках и митапах (Дубай, Ереван, Москва и другие); Возможность возмещения тренажерного зала, курсов; Мы ценим инициативу: можешь оптимизировать процессы или предлагать новое — всегда поддержим и поощрим; Твоя зп и рост в компании прямо пропорциональны твоему профессиональному вкладу и вовлеченности в продукт (у нас минимум текучки и у каждого своя история роста в компании).",
      "skills": [
        "Docker",
        "REST API",
        "Python",
        "SQL",
        "Высоконагруженные системы",
        "Работа с большими данными",
        "Чистый код (Clean Code)",
        "Работа с легаси-кодом",
        "Git",
        "Искусственный интеллект",
        "AI-инструменты разработки",
        "Claude",
        "GPT-5 / OpenAI API",
        "AI-coding",
        "AI-пайплайны",
        "Автоматизация разработки",
        "Golang",
        "CI/CD",
        "Продуктовое мышление",
        "Инициативность",
        "Самостоятельность",
        "Быстрое обучение",
        "Разработка с нуля"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:46:25.647Z"
    },
    {
      "id": "129380550",
      "title": "AI-разработчик (Python / Go / Frontend)",
      "url": "https://hh.ru/vacancy/129380550?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ООО СП Солюшен",
        "url": "https://hh.ru/employer/11545313?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Кто мы: Мы создаем экосистему сервисов и AI-продуктов, которая уже работает в десятках стран. Наш код двигает миллионы транзакций в день, соединяя людей, системы и данные.Мы растем кратно каждый год и ищем не просто сотрудников — будущих партнеров, которые живут своей работой и хотят влиять на будущее. Принцип простой: Чем успешнее твой проект — тем выше твой доход.Ты не делаешь стартап “в никуда”.Ты получаешь конкретный проект, который после реализации гарантированно зарабатывает деньги.Твоя задача — довести его до идеала и зарабатывать вместе с ним. Кого мы ищем: Мы ищем разработчиков нового поколения — тех, кто уже работает с ИИ или осознанно готов перейти на новый формат разработки. В этой роли ты будешь:  Разрабатывать новые сервисы и улучшать существующие продукты; Реализовывать фичи от идеи до деплоя; Работать с высокими нагрузками и большими объёмами данных; Оптимизировать системы и находить узкие места.  Нам подходят два типа кандидатов: Ты уже работаешь с ИИ:   50%+ кода пишешь с помощью Claude Code, GPT-5 или других моделей;   Строишь собственные AI-пайплайны и автоматизируешь рутину;   Умеешь писать код без ИИ, когда это необходимо.   Ты готов перестроиться:   Понимаешь, что классический подход к программированию устаревает;   Хочешь кратно увеличить эффективность за счёт AI;   Готов быстро войти в новый формат работы и реальные проекты.   Обязательное требование (без исключений):   Практический опыт работы с MCP (Model Context Protocol).   Важно:У нас есть тестовое задание — и это не “проверка ради галочки”.Если ты успешно его выполняешь, ты сразу получаешь оффер и оплату тестового задания при трудоустройстве. Чтобы тебе было максимально комфортно и честно, мы даём доступ к нашему внутреннему обучению по AI-кодингу.Это не базовый курс, а концентрат того, как мы реально пишем код с ИИ, строим пайплайны и работаем с MCP в продакшене. Если ты уже работал с MCP, тестовое обычно решается за ~2-3 часа. Даже если по итогу мы не совпадём, ты уйдёшь с:   новым подходом к AI-кодингу;   практическим пониманием MCP;   навыками, которые можно сразу применять в работе.   Мы предлагаем:  Формат работы: гибрид в Москве или 2-3 месяца удаленки, далее переезд в Москву (релокация с нас); В московском офисе — PlayStation, вкусный китайский чай и живая атмосфера, но можно работать и из любой точки мира; Гибкий график: важны результаты и ответственность, а не строгие рамки; Прозрачная система вознаграждения: фикс + бонусы за результат + премии за креативные решения; Совместные выезды в тёплые страны, тимбилдинги, корпоративы и спортивные выходные всей командой; Участие в международных выставках и митапах (Дубай, Ереван, Москва и другие); Возможность возмещения тренажерного зала, курсов; Мы ценим инициативу: можешь оптимизировать процессы или предлагать новое — всегда поддержим и поощрим; Твоя зп и рост в компании прямо пропорциональны твоему профессиональному вкладу и вовлеченности в продукт (у нас минимум текучки и у каждого своя история роста в компании).",
      "skills": [
        "Docker",
        "REST API",
        "Python",
        "SQL",
        "Высоконагруженные системы",
        "Работа с большими данными",
        "Чистый код (Clean Code)",
        "Работа с легаси-кодом",
        "Git",
        "Искусственный интеллект",
        "AI-инструменты разработки",
        "Claude",
        "GPT-5 / OpenAI API",
        "AI-coding",
        "AI-пайплайны",
        "Автоматизация разработки",
        "Golang",
        "CI/CD",
        "Продуктовое мышление",
        "Инициативность",
        "Самостоятельность",
        "Быстрое обучение",
        "Разработка с нуля"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:46:29.022Z"
    },
    {
      "id": "129380551",
      "title": "AI-разработчик (Python / Go / Frontend)",
      "url": "https://hh.ru/vacancy/129380551?query=golang&hhtmFrom=vacancy_search_list",
      "company": {
        "name": "ООО СП Солюшен",
        "url": "https://hh.ru/employer/11545313?hhtmFrom=vacancy"
      },
      "salary": null,
      "experience": "1–3 года",
      "employment": null,
      "schedule": null,
      "location": null,
      "description": "Кто мы: Мы создаем экосистему сервисов и AI-продуктов, которая уже работает в десятках стран. Наш код двигает миллионы транзакций в день, соединяя людей, системы и данные.Мы растем кратно каждый год и ищем не просто сотрудников — будущих партнеров, которые живут своей работой и хотят влиять на будущее. Принцип простой: Чем успешнее твой проект — тем выше твой доход.Ты не делаешь стартап “в никуда”.Ты получаешь конкретный проект, который после реализации гарантированно зарабатывает деньги.Твоя задача — довести его до идеала и зарабатывать вместе с ним. Кого мы ищем: Мы ищем разработчиков нового поколения — тех, кто уже работает с ИИ или осознанно готов перейти на новый формат разработки. В этой роли ты будешь:  Разрабатывать новые сервисы и улучшать существующие продукты; Реализовывать фичи от идеи до деплоя; Работать с высокими нагрузками и большими объёмами данных; Оптимизировать системы и находить узкие места.  Нам подходят два типа кандидатов: Ты уже работаешь с ИИ:   50%+ кода пишешь с помощью Claude Code, GPT-5 или других моделей;   Строишь собственные AI-пайплайны и автоматизируешь рутину;   Умеешь писать код без ИИ, когда это необходимо.   Ты готов перестроиться:   Понимаешь, что классический подход к программированию устаревает;   Хочешь кратно увеличить эффективность за счёт AI;   Готов быстро войти в новый формат работы и реальные проекты.   Обязательное требование (без исключений):   Практический опыт работы с MCP (Model Context Protocol).   Важно:У нас есть тестовое задание — и это не “проверка ради галочки”.Если ты успешно его выполняешь, ты сразу получаешь оффер и оплату тестового задания при трудоустройстве. Чтобы тебе было максимально комфортно и честно, мы даём доступ к нашему внутреннему обучению по AI-кодингу.Это не базовый курс, а концентрат того, как мы реально пишем код с ИИ, строим пайплайны и работаем с MCP в продакшене. Если ты уже работал с MCP, тестовое обычно решается за ~2-3 часа. Даже если по итогу мы не совпадём, ты уйдёшь с:   новым подходом к AI-кодингу;   практическим пониманием MCP;   навыками, которые можно сразу применять в работе.   Мы предлагаем:  Формат работы: гибрид в Москве или 2-3 месяца удаленки, далее переезд в Москву (релокация с нас); В московском офисе — PlayStation, вкусный китайский чай и живая атмосфера, но можно работать и из любой точки мира; Гибкий график: важны результаты и ответственность, а не строгие рамки; Прозрачная система вознаграждения: фикс + бонусы за результат + премии за креативные решения; Совместные выезды в тёплые страны, тимбилдинги, корпоративы и спортивные выходные всей командой; Участие в международных выставках и митапах (Дубай, Ереван, Москва и другие); Возможность возмещения тренажерного зала, курсов; Мы ценим инициативу: можешь оптимизировать процессы или предлагать новое — всегда поддержим и поощрим; Твоя зп и рост в компании прямо пропорциональны твоему профессиональному вкладу и вовлеченности в продукт (у нас минимум текучки и у каждого своя история роста в компании).",
      "skills": [
        "Docker",
        "REST API",
        "Python",
        "SQL",
        "Высоконагруженные системы",
        "Работа с большими данными",
        "Чистый код (Clean Code)",
        "Работа с легаси-кодом",
        "Git",
        "Искусственный интеллект",
        "AI-инструменты разработки",
        "Claude",
        "GPT-5 / OpenAI API",
        "AI-coding",
        "AI-пайплайны",
        "Автоматизация разработки",
        "Golang",
        "CI/CD",
        "Продуктовое мышление",
        "Инициативность",
        "Самостоятельность",
        "Быстрое обучение",
        "Разработка с нуля"
      ],
      "contacts": null,
      "publishedAt": null,
      "parsedAt": "2026-01-29T09:46:33.399Z"
    }
  ]
}